tutorials/multiphase/vof/vofSolver/laminar/waves/periodicSolitary/system/blockMeshDict
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (300 0 0)
    (300 10 0)
    (0 10 0)
    (0 0 0.1)
    (300 0 0.1)
    (300 10 0.1)
    (0 10 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (600 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    cyclic1_half0
    {
        type cyclic;
        neighbourPatch cyclic1_half1;
        faces
        (
            (0 4 7 3)
        );
    }
    cyclic1_half1
    {
        type cyclic;
        neighbourPatch cyclic1_half0;
        faces
        (
            (1 5 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
